chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx440f128h.h
PLIB_INLINE SFR_DATA _USB_VBUS_LINE_PWRD_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSON_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_OTG_ENABLE_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_OTGEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_VBUS_CHARGE_PULLUP_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSCHG_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_VBUS_DISCHARGE_PULLDN_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1OTGCON_VBUSDIS_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_ACTIVITY_PENDING_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_UACTPND_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_SLEEP_GUARD_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USLPGRD_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_IN_SUSPEND_MODE_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USUSPEND_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_POWERED_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1PWRC_USBPWR_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnIR_VAL_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IR_STALLIF_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnIE_VAL_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1IE_STALLIE_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnEIR_VAL_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIR_BTSEF_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_UnEIE_VAL_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EIE_BTSEE_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_ENDPOINT_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_ENDPT_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_DIRECTION_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_DIR_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LAST_PING_PONG_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1STAT_PPBI_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LIVE_JSTATE_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_JSTATE_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_LIVE_SE0_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_SE0_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_PACKET_XFER_DISABLED_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BUSY_WITH_TOKEN_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_GENERATE_RESET_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBRST_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_HOST_ENABLE_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_HOSTEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_RESUME_SIGNALING_ON_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_RESUME_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FREEZE_BUFFERS_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PPBRST_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_DEVICE_ENABLE_POS(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_POSITION;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

